[M_Orchid_PlotMission08 MissionDefinition]
MissionDescription="Now that you've found all the pieces of Captain Blade's compass, there's only one thing to do: take the reassembled compass to [place]Magnys Lighthouse[-place]. Scarlett says that if you activate Blade's compass at the top of the lighthouse, the true location of the Treasure of the Sands will be revealed to you. So, you've got that going for you. Which is nice."
TurnInDescription="The location of the Lost Treasure is revealed -- now go get it!"
MissionSummary="Take Captain Blade's compass to Magnys Lighthouse."
